In [1]:
import pandas as pd

In [2]:
data = { 
    'students' : ['mira','amir','izzat','zati','aziim','mat'],
    'Marks'    : [9,None,90,None,44,34]
}

In [3]:
df=pd.DataFrame(data)
print('Original Data')
df

Original Data

  students  Marks
0     mira    9.0
1     amir    NaN
2    izzat   90.0
3     zati    NaN
4    aziim   44.0
5      mat   34.0

In [4]:
print('Missing Data')
print('Number of Missing values are:',df.isnull().sum())

Missing Data
Number of Missing values are: students    0
Marks       2
dtype: int64

In [5]:
average_marks=df['Marks'].mean()
print(average_marks)

44.25

In [6]:
df.fillna(average_marks, inplace=True)
df

  students  Marks
0     mira   9.00
1     amir  44.25
2    izzat  90.00
3     zati  44.25
4    aziim  44.00
5      mat  34.00

In [7]:
students_data={'Name':['Amit','Anam','Chi','Sam','Ravi','Jai'], 'Marks':[85,None,65,75,None,55]}
df=pd.DataFrame(students_data)
df.fillna(df['Marks'].mean(), inplace=True)
df

   Name  Marks
0  Amit   85.0
1  Anam   70.0
2   Chi   65.0
3   Sam   75.0
4  Ravi   70.0
5   Jai   55.0

#### Dropna() Example

In [8]:
students_data={'Name':['Amit','Anam','Chi','Sam','Ravi','Jai'], 'Marks':[85,None,65,75,None,55]}
df=pd.DataFrame(students_data)
df

   Name  Marks
0  Amit   85.0
1  Anam    NaN
2   Chi   65.0
3   Sam   75.0
4  Ravi    NaN
5   Jai   55.0

In [9]:
df=df.dropna(subset=['Marks'])
df

   Name  Marks
0  Amit   85.0
2   Chi   65.0
3   Sam   75.0
5   Jai   55.0

In [10]:
students_data={'Name':['Amit','Anam','Chi','Sam','Ravi','Jai'], 'Marks':[85,None,65,75,None,55]}
df=pd.DataFrame(students_data)
df=df.dropna()
print('Dataset after dropna()')
df

Dataset after dropna()

   Name  Marks
0  Amit   85.0
2   Chi   65.0
3   Sam   75.0
5   Jai   55.0

In [11]:
emp_data={
    "Name":['Sam','Ali','Chang','Xi','Viz','Suhail'],
    "Age":[35,None,25,20,24,None],
    "Salary":[50000,30000,20000,40000,None,None],
    }
df=pd.DataFrame(emp_data)
print('Original Data')
df

Original Data

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali   NaN  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0      NaN
5  Suhail   NaN      NaN

In [12]:
print(df.isnull().sum())
df_drop=df.dropna()
df_drop
df_drop_salary=df.dropna(subset=['Salary'])
df_drop_salary
df

Name      0
Age       2
Salary    2
dtype: int64

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali   NaN  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0      NaN
5  Suhail   NaN      NaN

In [13]:
 df.fillna({'Age':df['Age'].mean(),'Salary':df['Salary'].mean()}, inplace=True)
df

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali  26.0  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0  35000.0
5  Suhail  26.0  35000.0